### Pandas-DataFrame and Series
Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two priimary data structures: Series and DataFrame. A Series is one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially hetregeneous  tabular data structure with labelled axes (rows and columns)

In [1]:
## Installing the pandas: it is required as it doesnot come inbuilt with python
pip install pandas

Collecting pandas
  Using cached pandas-2.2.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (13.0 MB)
Collecting tzdata>=2022.7
  Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Requirement already satisfied: numpy>=1.22.4 in /home/madhuranjan_kumar/Desktop/Krish_Naik_Udemy/Machine_Learning_NLP_Bootcamp/Python/.venv/lib/python3.10/site-packages (from pandas) (2.0.0)
Collecting pytz>=2020.1
  Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/madhuranjan_kumar/Desktop/Krish_Naik_Udemy/Machine_Learning_NLP_Bootcamp/Python/.venv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /home/madhuranjan_kumar/Desktop/Krish_Naik_Udemy/Machine_Learning_NLP_Bootcamp/Python/.venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [2]:
## Importing the library
import pandas as pd

#### 1. Series Datatype:

A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table

In [3]:
## Creating the series
import pandas as pd

data = [1,2,3,4,5]
series = pd.Series(data)
print("Series:\n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
### Create a series  from dictionary
data = {'a':1,'b':2,'c':3,'d':4} 
dict_series = pd.Series(data) ## The keys will be considered as the index
print(dict_series)
print(type(dict_series))

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Giveing the different indexes
data = [10,20,30,40,60,50]
indexes = ['a','b','c','d','e','f'] ## This must be of the the same length as the length of the data

series = pd.Series(data,index=indexes)
print(series)
print(type(series))

a    10
b    20
c    30
d    40
e    60
f    50
dtype: int64
<class 'pandas.core.series.Series'>

#### 2. DataFrame:

In [6]:
## Creating a DataFrame from a dictionary of list
data = {
    'Name': ['Madhuranjan','John','Jack'],
    'Age':[24,30,45],
    'City':['Kolkata','Bangalore','New York']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

          Name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   45   New York
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Madhuranjan', 24, 'Kolkata'],
       ['John', 30, 'Bangalore'],
       ['Jack', 45, 'New York']], dtype=object)

In [8]:
### Create a DataFrame from list of dictionaries
data = [
    {'name':'Madhuranjan','Age':24,"City":"Kolkata"},
    {'name':'John','Age':30,"City":"Bangalore"},
    {'name':'Jack','Age':34,"City":"New York"},
    {'name':'Bapi','Age':25,"City":"Florida"}
]

df = pd.DataFrame(data)
print(df)
print(type(df))

          name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   34   New York
3         Bapi   25    Florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
## Reading csv file
df = pd.read_csv('Online Sales Data.csv')
df.head() ## it will give the top 5 records from the DataFrame

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [10]:
## Getting the last 5 records
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [11]:
## Getting the first n records
df.head(10) ## here n = 10

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card
6,10007,2024-01-07,Electronics,MacBook Pro 16-inch,1,2499.99,2499.99,North America,Credit Card
7,10008,2024-01-08,Home Appliances,Blueair Classic 480i,2,599.99,1199.98,Europe,PayPal
8,10009,2024-01-09,Clothing,Nike Air Force 1,6,89.99,539.94,Asia,Debit Card
9,10010,2024-01-10,Books,Dune by Frank Herbert,2,25.99,51.98,North America,Credit Card

In [12]:
## Getting the last n records
df.tail(10) ## Here, n=10

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
230,10231,2024-08-18,Clothing,Adidas Originals Trefoil Hoodie,4,64.99,259.96,Asia,Debit Card
231,10232,2024-08-19,Books,Dune by Frank Herbert,2,9.99,19.98,North America,Credit Card
232,10233,2024-08-20,Beauty Products,Fresh Sugar Lip Treatment,1,24.00,24.00,Europe,PayPal
233,10234,2024-08-21,Sports,Hydro Flask Standard Mouth Water Bottle,3,32.95,98.85,Asia,Credit Card
234,10235,2024-08-22,Electronics,Bose QuietComfort 35 II Wireless Headphones,1,299.00,299.00,North America,Credit Card
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [13]:
data

[{'name': 'Madhuranjan', 'Age': 24, 'City': 'Kolkata'},
 {'name': 'John', 'Age': 30, 'City': 'Bangalore'},
 {'name': 'Jack', 'Age': 34, 'City': 'New York'},
 {'name': 'Bapi', 'Age': 25, 'City': 'Florida'}]

In [15]:
## Accessing data from the DataFrame
data = {
    'Name': ['Madhuranjan','John','Jack'],
    'Age':[24,30,45],
    'City':['Kolkata','Bangalore','New York']
}
df = pd.DataFrame(data)
df

          Name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   45   New York

In [16]:
## Extarcting the name column
df['Name']

0    Madhuranjan
1           John
2           Jack
Name: Name, dtype: object

In [17]:
type(df['Name']) ## It will be Series as we are picking one complete columns

pandas.core.series.Series

In [18]:
## using loc: loc is used to retrieve the row at particular index

df.loc[0]

Name    Madhuranjan
Age              24
City        Kolkata
Name: 0, dtype: object

In [20]:
## using iloc:
df.iloc[1]

Name         John
Age            30
City    Bangalore
Name: 1, dtype: object

In [25]:
### Accessing a Specified element
print(df.at[1,'Age'])

30

In [26]:
print(df.at[1,'Name'])

John

In [27]:
### accessing the specified element using iat
print(df.iat[2,2])

New York

In [28]:
df

          Name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   45   New York

In [29]:
## Data manipulation with DataFrames

##Adding a new column
df['Salary'] = [32000,22000,16000]
df

          Name  Age       City  Salary
0  Madhuranjan   24    Kolkata   32000
1         John   30  Bangalore   22000
2         Jack   45   New York   16000

In [33]:
## Removing a column
df.drop('Salary',axis=1)

          Name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   45   New York

In [34]:
df ## still after dropping the salary column will still exist as it is not a permanent operation

          Name  Age       City  Salary
0  Madhuranjan   24    Kolkata   32000
1         John   30  Bangalore   22000
2         Jack   45   New York   16000

In [35]:
## permanently dropping a column
df.drop('Salary',axis= 1,inplace=True)

In [37]:
df ## now salary is dropped permanently

          Name  Age       City
0  Madhuranjan   24    Kolkata
1         John   30  Bangalore
2         Jack   45   New York

In [38]:
## Adding age to column
df['Age'] = df['Age']+1

In [39]:
df

          Name  Age       City
0  Madhuranjan   25    Kolkata
1         John   31  Bangalore
2         Jack   46   New York

In [40]:
## Drop based on row
df.drop(0) ## it will temporarly drop the 0th row

   Name  Age       City
1  John   31  Bangalore
2  Jack   46   New York

In [41]:
## dropping the row permanently
df.drop(0,inplace=True)

In [44]:
df

   Name  Age       City
1  John   31  Bangalore
2  Jack   46   New York

In [45]:
## Reading csv file
df = pd.read_csv('Online Sales Data.csv')
df.head() ## it will give the top 5 records from the DataFrame

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [46]:
## Checking the data type of each column
print("Data Type: \n",df.dtypes)

Data Type:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [49]:
## Getting the statistical description of the dataframe for the numerical columns only
print("Statistical Description:\n",df.describe())

Statistical Description:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000